---
title: "01. AI 이론"
tags:
  - AICE 자격증 공부
---
## 정의
### 인공지능 
> 인간의 지적능력(추론, 인지)을 구현하는 모든 기술

### 머신러닝 
> 알고리즘으로 데이터를 분석, 학습하여 판단이나 예측하는 기술 (기계가 모델을 만든다)

- 선형회귀
- 로지스틱회귀
- K-최근접 이웃
- 결정트리
- 랜덤포레스트
- 서포트 벡터 머신

### 딥러닝
> **인공신경망** 알고리즘을 활용하는 머신러닝 기술, 이때 인공신경망은 뉴런 네트워크(~~N)를 의미한다.

- 심층신경망(DNN)
- 합성곱 신경망(CNN)
- 순환 신경망(RNN)
- 강화 학습

***

## 머신러닝
### 지도학습
- 정답지로 학습 분류, 예측 (특정 동물 사진을 주고 동물 정보를 알려주면서 분류 및 예측하게 만든다)

### 비지도 학습
- 정답없이 학습 군집, 특성 도출 (차원축소, 군집화, 이상치 채우기 등에 활용)

### 강화학습
- 시뮬레이션 반복 학습 성능 강화 등에 사용 (에이전트가 환경에서 수많은 시행착오를 하면서 이득을 극대화, 손해를 최소화하는 것이 포인트다)

***

AI 모델 구성 요소: 데이터, 모델링
- 개발 라이브러리
  - 판다스:행렬, 다차원 배열 처리
  - 넘파이:데이터 처리 및 분석
- 개발 언어
  - 파이썬
  - 자바
- 개발 환경 IDE
  - 아나콘다
  - VSCode
  - 구글 코랩

***

## AI 모델 학습 원리 

데이터 특징을 파악하고 규칙(패턴)으로 만든다. 출력값이 정답과 최대한 일치하기 위해 모델의 **비용함수(Cost function)** 구한다. 
비용함수를 최소화 하기 위해 **최적화 알고리즘**을 이용한다.

> Cost fucntion 는 **Y^(예측값)-Y(정답) = Cost, Loss, Error** 구한다.

> Optimize 알고리즘은 **Cost를 최소로 줄이기 위해 모델의 파라미터(w, b)를 업데이트**하면서 최적 모델로 생성한다.

***

## AI 모델링 순서

> 데이터 수집 → 데이터 정리 → (Train) 모델학습 & (Test) 테스트 데이터셋 → 모델테스트 (→ 모델학습으로 돌아가기도 한다) → 모델 배포
